from aiogram.types import ReplyKeyboardRemove, ReplyKeyboardMarkup, KeyboardButton, InlineKeyboardMarkup, \
    InlineKeyboardButton
import unicodedata

tips = ['критическое мышление', 'физическая подготовка', 'креативность', 'эмоциональная устойчивость', 'трудолюбие']

nokb = ReplyKeyboardRemove()

btn1 = InlineKeyboardButton('Архитектура и строительство', callback_data='arch')
btn2 = InlineKeyboardButton('Военное дело, безопасность, охрана', callback_data='mil')
btn3 = InlineKeyboardButton('Дипломатия', callback_data='dip')
btn4 = InlineKeyboardButton('Лингвистика', callback_data='ling')
btn5 = InlineKeyboardButton('IT', callback_data='it')
btn6 = InlineKeyboardButton('Искусство', callback_data='pnt')
btn7 = InlineKeyboardButton('Спорт', callback_data='pe')
btn8 = InlineKeyboardButton('Медицина', callback_data='med')
btn9 = InlineKeyboardButton('Физико-математические науки', callback_data='eng')
btn10 = InlineKeyboardButton('Химико-биологические науки', callback_data='chem')
st_but = InlineKeyboardMarkup(row_width=3)
st_but.add(btn1, btn2, btn3, btn4, btn5, btn6, btn7, btn8, btn9, btn10)

arch_uni = InlineKeyboardButton('МАСИ', callback_data='V1')
arch_but = InlineKeyboardMarkup(row_width=2)
arch_but.add(arch_uni)

VUZ1 = ['РГУФКСМиТ', 'pe', ['Cдать ГТО', 10, [3, 7, 1, 5, 7]],['Волонтерская (добровольческая) деятельность',10, [5, 3, 4, 7, 8]],['Чемпион Олимпийских, Паралимпийских, Сурдлимпийских игр и чемпионата Европы', 10, [3, 9, 4, 7, 8]], ['Золотая медаль', 10, [7, 5, 6, 6, 8]]]
VUZ2 = ['МАСИ', 'arch', ['Золотой значок ГТО', 5, [3, 7, 1, 5, 7]], ['Волонтерская (добровольческая) деятельность', 10, [5, 3, 4, 7, 8]],['Золотая медаль', 10, [8, 1, 9, 10, 10]]]
VUZ3 = ['МАРХИ', 'arch', ['Золотой значок ГТО', 2, [3, 7, 1, 5, 7]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Золотая медаль',10, [8, 1, 9, 10, 10]]]
VUZ4 = ['НИУ МГСУ', 'arch', ['Золотая медаль', 3, [8, 1, 9, 10, 10]], ['СПО с отличием', 3, [4, 6, 7, 9, 9]], ['Портфолио',5, [7, 1, 10, 7, 9]]]
VUZ5 = ['РАНХиГС', 'mil', ['Золотой значок ГТО', 3, [3, 7, 1, 5, 7]], ['СПО с отличием', 5, [4, 6, 7, 9, 9]], ['Золотая медаль',5, [8, 1, 9, 10, 10]]]
VUZ6 = ['РГУНиГ', 'dip', ['Золотая медаль',10, [8, 1, 9, 10, 10]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Портфолио',10, [7, 1, 10, 7, 9]]]
VUZ7 = ['МГЛУ', 'dip', ['Золотая медаль',10, [8, 1, 9, 10, 10]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Портфолио',2, [7, 1, 10, 7, 9]]]
VUZ8 = ['ВАВТ', 'dip', ['Золотой значок ГТО', 2, [3, 7, 1, 5, 7]], ['СПО с отличием', 5, [4, 6, 7, 9, 9]], ['Золотая медаль',5, [8, 1, 9, 10, 10]]]
VUZ9 = ['РГСУ', 'ling', ['Золотая медаль',10, [8, 1, 9, 10, 10]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Портфолио',5, [7, 1, 10, 7, 9]]]
VUZ10 = ['МГИМО', 'ling', ['Золотая медаль',4, [8, 1, 9, 10, 10]], ['СПО с отличием', 4, [4, 6, 7, 9, 9]], ['Портфолио',3, [7, 1, 10, 7, 9]]]
VUZ11 = ['РГГУ', 'ling', ['Золотая медаль',4, [8, 1, 9, 10, 10]], ['СПО с отличием', 4, [4, 6, 7, 9, 9]], ['Портфолио',3, [7, 1, 10, 7, 9]]]
VUZ12 = ['МТУСИ', 'it', ['Золотой значок ГТО', 2, [3, 7, 1, 5, 7]], ['Золотая медаль',10, [8, 1, 9, 10, 10]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Портфолио',10, [7, 1, 10, 7, 9]]]
VUZ13 = ['МИСИС', 'it', ['Золотой значок ГТО', 2, [3, 7, 1, 5, 7]], ['Золотая медаль',5, [8, 1, 9, 10, 10]], ['СПО с отличием', 5, [4, 6, 7, 9, 9]], ['Портфолио',5, [7, 1, 10, 7, 9]]]
VUZ14 = ['МГТУ "СТАНКИН"', 'it', ['Золотой значок ГТО', 6, [3, 7, 1, 5, 7]], ['Золотая медаль',10, [8, 1, 9, 10, 10]], ['СПО с отличием', 10, [4, 6, 7, 9, 9]], ['Портфолио', 10, [7, 1, 10, 7, 9]]]


